In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Data Scientist.csv')
print(df.shape)
df.head(10)

(690, 13)

,Unnamed: 0,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Size,Founded,Type of ownership,Industry,Sector,Revenue
0,0,Data Scientist,"₹9,96,452 /yr (est.)","Data Science Analyst\nQualification : BE, MBA\...",NaN,Six Sails Group,Farīdābād,NaN,NaN,NaN,NaN,NaN,NaN
1,1,Data Scientist,"₹5,66,099 /yr (est.)",Responsibilities\n• Anchor ML development trac...,3.9,Infosys Limited\n3.9,Bangalore,10000+ Employees,1981.0,Company - Public,Information Technology Support Services,Information Technology,$10+ billion (USD)
2,2,Sr. Data Scientist,"₹9,60,000 /mo (est.)",Be part of team using advanced real-time scale...,3.9,Lotus Interworks Inc\n3.9,Cochin,1 to 50 Employees,1997.0,Company - Private,Computer Hardware Development,Information Technology,$1 to $5 million (USD)
3,3,Data Scientist,NaN,Data Scientist\nJob Description\nThe Data Scie...,3.1,Kimberly-Clark\n4.0,Bangalore,10000+ Employees,1872.0,Company - Public,Consumer Product Manufacturing,Manufacturing,$10+ billion (USD)
4,4,Market Data - Data Scientist,NaN,Market Data Data-Scientist\n\nRole\nBuild Pyth...,3.6,Wells Fargo\n3.6,Telangana,10000+ Employees,1852.0,Company - Public,Banking & Lending,Finance,$10+ billion (USD)
5,5,Data Scientist,NaN,About this role:\n\nThe role involves developi...,3.6,Wells Fargo\n3.6,Bangalore,10000+ Employees,1852.0,Company - Public,Banking & Lending,Finance,$10+ billion (USD)
6,6,"Faculty Member in Data science , FSWD , Cloud ...","₹3,30,000 /mo (est.)","Faculty in Data science, FSWD, Cloud and DevOp...",NaN,Subbarao Vamanan and co,Hyderābād,NaN,NaN,NaN,NaN,NaN,NaN
7,7,DNA_Analytics,"₹8,12,637 /yr (est.)",Responsibilities\nApplies business processes p...,3.9,Infosys Limited\n3.9,Bangalore,10000+ Employees,1981.0,Company - Public,Information Technology Support Services,Information Technology,$10+ billion (USD)
8,8,Head of Academics - Data Science,"₹7,00,000 /yr (est.)",Job Description:\nDevelop educational process ...,NaN,Boston Institute of Analytics,Mumbai,NaN,NaN,NaN,NaN,NaN,NaN
9,9,Technology Lead : Data Science I Machine Learning,"₹6,03,777 /yr (est.)",Responsibilities\nA day in the life of an Info...,3.9,Infosys Limited\n3.9,Bangalore,10000+ Employees,1981.0,Company - Public,Information Technology Support Services,Information Technology,$10+ billion (USD)

#### Salary

In [3]:
# Removing the null values from the Salary Estimate column
df = df[df['Salary Estimate'].notna()]

# Drop duplicates

In [4]:
df.shape

(556, 13)

In [5]:
df.head()

,Unnamed: 0,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Size,Founded,Type of ownership,Industry,Sector,Revenue
0,0,Data Scientist,"₹9,96,452 /yr (est.)","Data Science Analyst\nQualification : BE, MBA\...",NaN,Six Sails Group,Farīdābād,NaN,NaN,NaN,NaN,NaN,NaN
1,1,Data Scientist,"₹5,66,099 /yr (est.)",Responsibilities\n• Anchor ML development trac...,3.9,Infosys Limited\n3.9,Bangalore,10000+ Employees,1981.0,Company - Public,Information Technology Support Services,Information Technology,$10+ billion (USD)
2,2,Sr. Data Scientist,"₹9,60,000 /mo (est.)",Be part of team using advanced real-time scale...,3.9,Lotus Interworks Inc\n3.9,Cochin,1 to 50 Employees,1997.0,Company - Private,Computer Hardware Development,Information Technology,$1 to $5 million (USD)
6,6,"Faculty Member in Data science , FSWD , Cloud ...","₹3,30,000 /mo (est.)","Faculty in Data science, FSWD, Cloud and DevOp...",NaN,Subbarao Vamanan and co,Hyderābād,NaN,NaN,NaN,NaN,NaN,NaN
7,7,DNA_Analytics,"₹8,12,637 /yr (est.)",Responsibilities\nApplies business processes p...,3.9,Infosys Limited\n3.9,Bangalore,10000+ Employees,1981.0,Company - Public,Information Technology Support Services,Information Technology,$10+ billion (USD)

In [6]:
df['monthly'] = df["Salary Estimate"].apply(lambda x: 1 if"/mo (est.)" in x.lower() else 0)
df['hourly'] = df["Salary Estimate"].apply(lambda x: 1 if"/hr (est.)" in x.lower() else 0)

In [7]:
salary = df["Salary Estimate"].apply(lambda x: x.split('/')[0])
minus_rs = salary.apply(lambda x:x.replace("₹", "").replace(",", ""))

#### Rating

In [8]:
df["Rating"] = df['Rating'].fillna(-1)
df['company_txt'] = df.apply(lambda x :x['Company Name'] if x['Rating'] < 0 else x['Company Name'][:-3], axis=1 )

In [9]:
df["Rating"].isnull()

0      False
1      False
2      False
6      False
7      False
       ...
684    False
685    False
686    False
688    False
689    False
Name: Rating, Length: 556, dtype: bool

#### Company Age

In [10]:
df["Founded"] = df['Founded'].fillna(-1)
df['Age'] = df['Founded'].apply( lambda x: x if x<1 else 2022 - x)

In [11]:
df["Python"] = df["Job Description"].apply(lambda x: 1 if "python" in x.lower() else 0)
df["Python"].value_counts()

1    400
0    156
Name: Python, dtype: int64

In [12]:
df["Deep Learning"] = df["Job Description"].apply(lambda x: 1 if  "deep learning" in x.lower() else 0)
df["Deep Learning"].value_counts()

0    426
1    130
Name: Deep Learning, dtype: int64

In [13]:
df["Spark"] = df["Job Description"].apply(lambda x: 1 if  "spark" in x.lower() else 0)
df["Spark"].value_counts()

0    414
1    142
Name: Spark, dtype: int64

#### Removing Duplicates

In [14]:
df_out = df.drop(['Unnamed: 0'], axis=1)
df_out = df_out.drop_duplicates()

In [15]:
df_out.to_csv("Salary_Data_Cleaned.csv", index = False)